/* Завдання 3
1. Створіть об'єкт car1 з такими властивостями:
brand: рядок, представляє марку автомобіля.
model: рядок, представляє модель автомобіля.
year: число, представляє рік випуску автомобіля.
2. Створіть об'єкт car2 з такими властивостями:
brand: рядок, представляє марку автомобіля.
model: рядок, представляє модель автомобіля.
owner: число, представляє рік випуску автомобіля.   ???????????????? що тут має бути? year: число, представляє рік випуску автомобіля. чи owner - хто власник???
3. Створіть об'єкт car3. Використайте оператор spread, щоб додати всі властивості що є в car1 та car2 до об’єкту car3.
Виведіть об'єкт car3 в консоль. */


const car1 = {
    brand: "BMW",
    model: "X5",
    year: 2010,
}

const car2 = {
    brand: "KIA",
    model: "K5",
    year: 2019,   //Взяла рік випуску автомобіля
    owner: "Inna",  // додала ще й власника
}

const car3 = {
  ...car1,
  ...car2,
};

console.log("Car3:", car3);