/* Завдання 2
1. Створіть об'єкт book з такими властивостями:
title: рядок, представляє назву книги.
author: рядок, представляє автора книги.
year: рядок, представляє ім'я власника автомобіля    ???????????????? Може рік виходу книги?
2. Деструктуризуйте назву та автора книги з об'єкта book.
3. Виведіть деструктуризовані змінні в консоль */


const book = {
    title: "Angels and Demons",
    author: "Dan Brown",
    year: 2000,        // вказала рік виходу книги
};

const {title, author} = book;


console.log("Title:", title);
console.log("Author:", author);