/* Додаткове завдання 3
Дано масив чисел. Потрібно повернути різницю між найбільшим і найменшим значенням у масиві.
Наприклад:
Для масиву [23, 3, 19, 21, 16] результат має бути 20 (тобто 23 - 3).
Для масиву [1, 434, 555, 34, 112] результат має бути 554 (тобто 555 - 1).
Масив міститиме щонайменше два елементи. Діапазон вхідних даних гарантує, що обчислення max - min не призведе до переповнення цілого числа. */


function differenceBetweenMaxAndMin(numbers) {
  const max = Math.max(...numbers);
  const min = Math.min(...numbers);

  return max - min;
}

