/*Завдання 3: Генерація таблиці множення

Створіть програму, яка генерує таблицю множення для обраного числа за допомогою кожного з циклів for, while .

Виберіть число для якого потрібно згенерувати таблицю множення.*/


const number = 5;

//2. Використовуючи цикл for, створіть таблицю множення для обраного числа від 1 до 10. Виведіть результат в консоль.
for (let i = 1; i <= 10; i++) {
  console.log(`${number} x ${i} = ${number * i}`);
}

console.log("");


//3. Використовуючи цикл while створіть аналогічну таблицю множення та виведіть її в консоль.
let i = 1;

while (i <= 10) {
  console.log(`${number} x ${i} = ${number * i}`);
  i++;
}