/*Завдання 2: Конкатенація радків та шаблонний рядок

Створіть дві змінні, які містять імена двох осіб. 
Використовуючи конкатенацію рядків, створіть новий рядок, 
який містить вітання для обох осіб. Виведіть результат в консоль. 
Потім використайте шаблонний рядок для створення того ж вітання. 
Виведіть результат в консоль.*/


const name1 = "Inna";
const name2 = "Roma";

// Конкатенація
const greetingConcat = "Hello, " + name1 + " and " + name2 + "!";
console.log(greetingConcat);

// Шаблонний рядок
const greetingTemplate = `Hello, ${name1} and ${name2}!`;
console.log(greetingTemplate);
